microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_pwm.c
/* Microchip Technology Inc. and its subsidiaries.  You may use this software 
 * and any derivatives exclusively with Microchip products. 
 * 
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS".  NO WARRANTIES, WHETHER 
 * EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED 
 * WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A 
 * PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION 
 * WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION. 
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
 * INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND 
 * WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS 
 * BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE 
 * FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS 
 * IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF 
 * ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE 
 * TERMS. 
 */

// Include standard header files
#include <xc.h> // include processor files - each processor file is guarded.  
#include <stdint.h> // include standard integer data types
#include <stdbool.h> // include standard boolean data types
#include <stddef.h> // include standard definition data types

#include "p33c_pwm.h"

/*********************************************************************************
 * @fn uint16_t p33c_PwmModule_Initialize(void)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief Initializes the PWM base module by resetting all its registers to default
 * @return 0 = failure, disposing PWM generator was not successful
 * @return 1 = success, disposing PWM generator was successful
 * 
 * @details
 *     This function initializes the PWM module base registers with default
 *     values for maximum performance. 
 * 
 *     Default configuration:
 *         - auxiliary clock is selected as main input clock source
 *         - all output logic functions are disabled
 *         - all output logic events are disabled
 *         - all master timing registers are cleared
 *         - all PWM register locks are removed, allowing unrestricted SFR writes
 * 
 *********************************************************************************/

volatile uint16_t p33c_PwmModule_Initialize(void)
{
    volatile uint16_t retval=1;
    
    retval = p33c_PwmModule_ConfigWrite(pwmConfigDefault);
    
    return(retval);
}

/*********************************************************************************
 * @fn struct P33C_PWM_MODULE_s* p33c_PwmModule_GetHandle(void)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief Gets pointer to PWM module SFR set
 * @return struct P33C_PWM_GENERATOR_s: PWM generator object of the selected PWM generator instance
 *  
 * @details
 *      This function returns the PWM generator index, the PWM generator group
 *      (1 = [PG1-PG4], 2 = [PG5-PG8]) and the address pointer (handle) of
 *      the PWM generator Special Function Register set. handle can be used
 *      to directly read from/write to PWM registers of the selected PWM 
 *      generator with zero API overhead.
 * 
 *********************************************************************************/

volatile struct P33C_PWM_MODULE_s* p33c_PwmModule_GetHandle(void)
{
    volatile struct P33C_PWM_MODULE_s* pwm;
    
    // Capture Handle: set pointer to memory address of desired PWM instance
    pwm = (volatile struct P33C_PWM_MODULE_s*) ((volatile uint8_t*)&PCLKCON);
    
    return(pwm);
}

/*********************************************************************************
 * @fn uint16_t p33c_PwmModule_Dispose(void)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief Resets all PWM base module registers to their RESET default values
 * @return  0 = failure, disposing PWM generator was not successful
 * @return  1 = success, disposing PWM generator was successful
 * 
 * @details
 *     This function clears all PWM module base registers to their
 *     default values set when the device comes out of RESET. 
 * 
 *     Default configuration:
 *         - no main input clock source and scalers are selected
 *         - all output logic functions are disabled
 *         - all output logic events are disabled
 *         - all master timing registers are cleared
 *         - all PWM register locks are removed, allowing unrestricted SFR writes
 * 
 *********************************************************************************/

volatile uint16_t p33c_PwmModule_Dispose(void)
{
    volatile uint16_t retval=1;
    
    retval = p33c_PwmModule_ConfigWrite(pwmConfigClear);
    
    return(retval);
}

/*********************************************************************************
 * @fn struct P33C_PWM_MODULE_s p33c_PwmModule_ConfigRead(void)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief Read the current configuration from the PWM base module registers
 * @return struct P33C_PWM_MODULE_s
 * 
 * @details
 *     This function reads all registers with their current configuration into
 *     a data structure of type P33C_PWM_MODULE_s. Users can read and 
 *     verify of modify the configuration to write it back to the PWM module  
 *     base registers.
 * 
 *********************************************************************************/

volatile struct P33C_PWM_MODULE_s p33c_PwmModule_ConfigRead(void)
{
    volatile struct P33C_PWM_MODULE_s* pwm;

    // Set pointer to memory address of desired PWM instance
    pwm = (volatile struct P33C_PWM_MODULE_s*) 
        ((volatile uint8_t*) &PCLKCON);

    return(*pwm);    
    
}

/*********************************************************************************
 * @fn uint16_t p33c_PwmModule_ConfigWrite(volatile struct P33C_PWM_MODULE_s pwmConfig)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief Writes a user-defined configuration to the PWM base module registers
 * @param struct P33C_PWM_MODULE_s pwmConfig
 * @return 0 = failure, disposing PWM generator was not successful
 * @return 1 = success, disposing PWM generator was successful
 * 
 * @details
 *     This function writes a user-defined PWM module configuration of type 
 *     P33C_PWM_MODULE_s to the PWM module base registers. The 
 *     individual register configurations have to be set in user-code 
 *     before calling this function. To simplify the configuration process
 *     of standard functions, this driver provides templates, which can be 
 *     loaded and written directly (see function p33c_PwmInitialize(void) 
 *     for details)
 * 
 *********************************************************************************/

volatile uint16_t p33c_PwmModule_ConfigWrite(volatile struct P33C_PWM_MODULE_s pwmConfig)
{
    volatile uint16_t retval=1;
    volatile struct P33C_PWM_MODULE_s* pwm;    

    // Set pointer to memory address of desired PWM instance
    pwm = (volatile struct P33C_PWM_MODULE_s*) 
        ((volatile uint8_t*) &PCLKCON);
    *pwm = pwmConfig;
    
