microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_pwm.c
    return(retval);
    
}

/*********************************************************************************
 * @fn struct P33C_PWM_GENERATOR_s p33c_PwmGenerator_ConfigRead(volatile uint16_t pgInstance)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief  Disposes a given PWM generator by resetting all its registers to default
 * @param  uint16_t pgInstance: Instance of the PWM generator (e.g. 1 = PG1, 2=PG2, etc.)
 * @return struct P33C_PWM_GENERATOR_s: generic PWM generator Special Function Register set
 * 
 * @details
 *     This function copies the contents of all PWM generator registers of the 
 *     specified generator instance (e.g. PG2) to a user variable of type 
 *     P33C_PWM_GENERATOR_t. This 'virtual' PWM configuration can then , for  
 *     example, be analyzed and/or modified in user code and applied to another 
 *     PWM generator using the function p33c_PwmGenerator_ConfigWrite(...). 
 * 
 *********************************************************************************/

volatile struct P33C_PWM_GENERATOR_s p33c_PwmGenerator_ConfigRead(volatile uint16_t pgInstance)
{
    volatile struct P33C_PWM_GENERATOR_s* pg;    

    // Set pointer to memory address of desired PWM instance
    pg = (volatile struct P33C_PWM_GENERATOR_s*) 
        ((volatile uint8_t*) &PG1CONL + ((pgInstance - 1) * P33C_PWMGEN_SFR_OFFSET));

    return(*pg);
    
}

/*********************************************************************************
 * @fn uint16_t p33c_PwmGenerator_ConfigWrite(
        volatile uint16_t pgInstance, 
        volatile struct P33C_PWM_GENERATOR_s pgConfig)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief Disposes a given PWM generator by resetting all its registers to default
 * @param pgInstance: Instance of the PWM generator (e.g. 1 = PG1, 2=PG2, etc.)
 * @param struct P33C_PWM_GENERATOR_s: generic PWM generator Special Function Register set
 * @return 0 = failure, disposing PWM generator was not successful
 * @return 1 = success, disposing PWM generator was successful
 * 
 * @details
 *     This function writes a user-defined PWM generator configuration of type 
 *     P33C_PWM_GENERATOR_t to the given PWM generator peripheral instance (e.g. PG2). 
 * 
 *********************************************************************************/

volatile uint16_t p33c_PwmGenerator_ConfigWrite(
        volatile uint16_t pgInstance, 
        volatile struct P33C_PWM_GENERATOR_s pgConfig
)
{
    volatile uint16_t retval=1;
    volatile struct P33C_PWM_GENERATOR_s* pg;    

    // Set pointer to memory address of desired PWM instance
    pg = (volatile struct P33C_PWM_GENERATOR_s*) 
        ((volatile uint8_t*) &PG1CONL + ((pgInstance - 1) * P33C_PWMGEN_SFR_OFFSET));
    *pg = pgConfig;
    
    return(retval);
    
}

/*********************************************************************************
 * @fn uint16_t p33c_PwmGenerator_Initialize(volatile uint16_t pgInstance)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief  Initializes a given PWM generator by resetting all its registers to default
 * @param  uint16_t pgInstance: Instance of the PWM generator (e.g. 1 = PG1, 2=PG2, etc.)
 * @return 0 = failure, disposing PWM generator was not successful
 * @return 1 = success, disposing PWM generator was successful
 * 
 * @details
 *     This function initializes the specified PWM Generator with default
 *     input clock settings and high resolution mode enabled. All other
 *     Special Function Registers (SFR) are reset to their RESET default 
 *     values.
 * 
 *********************************************************************************/

volatile uint16_t p33c_PwmGenerator_Initialize(volatile uint16_t pgInstance)
{
    volatile uint16_t retval=1;
    volatile struct P33C_PWM_GENERATOR_s* pg;    
    
    
    // Set pointer to memory address of desired PWM instance
    pg = p33c_PwmGenerator_GetHandle(pgInstance);

    // Disable the PWM generator
    retval &= p33c_PwmGenerator_Disable(pg);

    // Reset all SFRs to default
    p33c_PwmGenerator_ConfigWrite(pgInstance, pgConfigClear);
    
    /* PWM GENERATOR CONTROL REGISTER LOW */
    pg->PGxCONL.bits.ON = 0;         // Disable PWM generator
    pg->PGxCONL.bits.CLKSEL = 0b01;  // Clock Selection: Selected by PWM module register PCLKCON.MCLKSEL bits  
    pg->PGxCONL.bits.MODSEL = 0b000; // Mode Selection: Independent Edge PWM mode 
    pg->PGxCONL.bits.TRGCNT = 0b000; // Trigger Count Selection: PWM Generator produces 1 PWM cycle after triggered 
    pg->PGxCONL.bits.HREN = 1;       // PWM Generator 1 High-Resolution Enable bit: PWM Generator 1 operates in High-Resolution mode
       
    return(retval);
}


/*********************************************************************************
 * @fn uint16_t p33c_PwmGenerator_Dispose(volatile uint16_t pgInstance)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief  Disposes a given PWM generator by resetting all its registers to default
 * @param  uint16_t pgInstance: Instance of the PWM generator (e.g. 1 = PG1, 2=PG2, etc.)
 * @return 0 = failure, disposing PWM generator was not successful
 * @return 1 = success, disposing PWM generator was successful
 * 
 * @details
 *     This function disables the specified PWM Generator and clears all
 *     its Special Function Registers (SFR) to their RESET default values.
 * 
 * ********************************************************************************/

volatile uint16_t p33c_PwmGenerator_Dispose(volatile uint16_t pgInstance)
{
    volatile uint16_t retval=1;
    
    // Clear all registers of pgInstance
    p33c_PwmGenerator_ConfigWrite(pgInstance, pgConfigClear);
    
    return(retval);
}

/*********************************************************************************
 * @fn uint16_t p33c_PwmGenerator_Enable(volatile struct P33C_PWM_GENERATOR_s* pg)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief  Enables a given PWM generator with output pins disabled
 * @param  struct P33C_PWM_GENERATOR_s* pg
 * @return 0 = failure, enabling PWM generator was not successful
 * @return 1 = success, enabling PWM generator was successful
 * 
 * @details
 *     This function enables the PWM Generator and adds delay before enabling  
 *     PWM output pins. After having successfully enabled the generator,
 *     users need to call function PWM_Generator_Resume to allow the PWM 
 *     generator 
 * 
 *********************************************************************************/

volatile uint16_t p33c_PwmGenerator_Enable(volatile struct P33C_PWM_GENERATOR_s* pg)
{
    volatile uint16_t retval=1;
    volatile uint16_t timeout=0;
    
    // Set PWM generator override bits to prevent signals being generated outside the device
    pg->PGxIOCONL.bits.OVRENH = 1;
    pg->PGxIOCONL.bits.OVRENL = 1;

    // Assign GPIO ownership to I/O module control 
    pg->PGxIOCONH.bits.PENH = 0;
    pg->PGxIOCONH.bits.PENL = 0;
    
