microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_pwm.c
    // Turn on the PWM generator
    pg->PGxCONL.bits.ON = 1;
    
    // enforce update of timing registers
    pg->PGxSTAT.bits.UPDREQ = 1;
   
    // If high resolution mode is enabled, check if clock has locked in without errors
    if(pg->PGxCONL.bits.HREN)
    {
        while((!PCLKCONbits.HRRDY) && (timeout++<5000));
         if ((timeout >= 5000) || (PCLKCONbits.HRERR)) // if there is an error
            return(0);  // return ERROR     
        
    }
    
    // Assign GPIO ownership to given PWM generator 
    pg->PGxIOCONH.bits.PENH = 1;
    pg->PGxIOCONH.bits.PENL = 1;
    
    return(retval);       
    
}
 
/*********************************************************************************
 * @fn uint16_t p33c_PwmGenerator_Disable(volatile struct P33C_PWM_GENERATOR_s* pg)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief  Disables a given PWM generator 
 * @param  struct P33C_PWM_GENERATOR_s* pg
 * @return 0 = failure, disabling PWM generator was not successful
 * @return 1 = success, disabling PWM generator was successful
 * 
 * @details
 *     This function disables the PWM Generator and locks its
 *     PWM output pins in a safe state.
 * 
 *********************************************************************************/

volatile uint16_t p33c_PwmGenerator_Disable(volatile struct P33C_PWM_GENERATOR_s* pg)
{
    volatile uint16_t retval=1;
    
    // Set PWM generator override bits to prevent signals being generated outside the device
    pg->PGxIOCONL.bits.OVRENH = 1;
    pg->PGxIOCONL.bits.OVRENL = 1;

    // Assign GPIO ownership to I/O module control 
    pg->PGxIOCONH.bits.PENH = 0;
    pg->PGxIOCONH.bits.PENL = 0;
    
    // Turn on the PWM generator
    pg->PGxCONL.bits.ON = 0;
    
    return(retval);       
    
}

/*********************************************************************************
 * @fn uint16_t p33c_PwmGenerator_Resume(volatile struct P33C_PWM_GENERATOR_s* pg)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief  Disables a PWM generator IOs
 * @param  struct P33C_PWM_GENERATOR_s* pg
 * @return 0 = failure, enabling PWM generator IOs was not successful
 * @return 1 = success, enabling PWM generator IOs was successful
 * 
 * @details
 *     This function enables the PWM Generator IO instance allowing 
 *     signals to be routed to the output pins. This on/off transition
 *     occurs synchronously to the PWM period. 
 * 
 *********************************************************************************/

volatile uint16_t p33c_PwmGenerator_Resume(volatile struct P33C_PWM_GENERATOR_s* pg)
{
    volatile uint16_t retval=1;
    
    // Set PWM generator override bits to prevent signals being generated outside the device
    pg->PGxIOCONL.bits.OVRENH = 0;
    pg->PGxIOCONL.bits.OVRENL = 0;

    
    return(retval);       
    
}

/*********************************************************************************
 * @fn uint16_t p33c_PwmGenerator_Suspend(volatile struct P33C_PWM_GENERATOR_s* pg)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief  Disables the PWM generator outputs but keeps the module running
 * @param  struct P33C_PWM_GENERATOR_s* pg
 * @return 0 = failure, enabling PWM generator IOs was not successful
 * @return 1 = success, enabling PWM generator IOs was successful
 * 
 * @details
 *     This function disables the PWM Generator IO instance preventing 
 *     signals to be routed to the output pins. This on/off transition
 *     occurs synchronously to the PWM period. 
 * 
 *********************************************************************************/

volatile uint16_t p33c_PwmGenerator_Suspend(volatile struct P33C_PWM_GENERATOR_s* pg)
{
    volatile uint16_t retval=1;
    
    // Set PWM generator override bits to prevent signals being generated outside the device
    pg->PGxIOCONL.bits.OVRENH = 1;
    pg->PGxIOCONL.bits.OVRENL = 1;

    
    return(retval);       
    
}


/*********************************************************************************
 * @fn uint16_t p33c_PwmGenerator_SetPeriod(volatile struct P33C_PWM_GENERATOR_s* pg, volatile uint16_t period )
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief  Sets the period of a given PWM generator 
 * @param  struct P33C_PWM_GENERATOR_s* pg
 * @param  uint16_t period: Counter compare value of the generator time base
 * @return 0 = failure, disabling PWM generator was not successful
 * @return 1 = success, disabling PWM generator was successful
 * 
 * @details
 *     This function writes the value specified by 'period' to the PERIOD register
 *     of the specified PWM generator.
 * 
 *********************************************************************************/

volatile uint16_t p33c_PwmGenerator_SetPeriod(
            volatile struct P33C_PWM_GENERATOR_s* pg, 
            volatile uint16_t period
    )
{
    volatile uint16_t retval=1;
    
    // Set PWM generator period
    pg->PGxPER.value = period;
    
    return(retval);       
    
}


/*********************************************************************************
 * @fn uint16_t p33c_PwmGenerator_SetDutyCycle(
            volatile struct P33C_PWM_GENERATOR_s* pg, 
            volatile uint16_t duty
    )
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief Sets the on-time of a given PWM generator 
 * @param struct P33C_PWM_GENERATOR_s* pg
 * @param uint16_t duty
 * @return 0 = failure, disabling PWM generator was not successful
 * @return 1 = success, disabling PWM generator was successful
 * 
 * @details
 *     This function writes the value specified by 'duty' to the DUTY CYCLE register
 *     of the specified PWM generator.
 * 
 *********************************************************************************/

volatile uint16_t p33c_PwmGenerator_SetDutyCycle(
            volatile struct P33C_PWM_GENERATOR_s* pg, 
            volatile uint16_t duty
    )
{
    volatile uint16_t retval=1;
    
    // Set PWM generator duty cycle
    pg->PGxDC.value = duty;
    
