microchip-pic-avr-solutions/epc9143-power-advanced-voltage-mode-control/epc9143-avmc.X/sources/common/p33c_pral/p33c_pwm.c
    return(retval);       
    
}


/*********************************************************************************
 * @fn uint16_t p33c_PwmGenerator_SetDeadTimes(
                volatile struct P33C_PWM_GENERATOR_s* pg, 
                volatile uint16_t dead_time_rising, 
                volatile uint16_t dead_time_falling)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief  Sets the dead-times of a given PWM generator 
 * @param  struct P33C_PWM_GENERATOR_s* pg
 * @param  uint16_t dead_time_rising
 / @param  uint16_t dead_time_falling
 * @return 0 = failure, disabling PWM generator was not successful
 * @return 1 = success, disabling PWM generator was successful
 * 
 * @details
 *     This function writes the value specified by 'duty' to the DUTY CYCLE register
 *     of the specified PWM generator.
 * 
 *********************************************************************************/

volatile uint16_t p33c_PwmGenerator_SetDeadTimes(
                volatile struct P33C_PWM_GENERATOR_s* pg, 
                volatile uint16_t dead_time_rising, 
                volatile uint16_t dead_time_falling
    )
{
    volatile uint16_t retval=1;
    
    // Set PWM generator period
    pg->PGxDTH.value = dead_time_rising;
    pg->PGxDTL.value = dead_time_falling;
    
    return(retval);       
    
}
/*********************************************************************************
 * @fn struct P33C_PWM_GENERATOR_s* p33c_PwmGenerator_GetHandle(volatile uint16_t pgInstance)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief  Returns the PWM generator index
 * @param  uint16_t pgInstance:   Index of the selected PWM generator (1=PG1, 2=PG2, etc.)
 * @return struct P33C_PWM_GENERATOR_s*: Pointer to PWM generator object of the selected PWM generator instance
 *  
 * @details
 *      This function returns the PWM generator index, the PWM generator group
 *      (1 = [PG1-PG4], 2 = [PG5-PG8]) and the address pointer (pgHandle) of
 *      the PWM generator Special Function Register set. pgHandle can be used
 *      to directly read from/write to PWM registers of the selected PWM 
 *      generator with zero API overhead.
 * 
 *********************************************************************************/

volatile struct P33C_PWM_GENERATOR_s* p33c_PwmGenerator_GetHandle(volatile uint16_t pgInstance)
{
    volatile struct P33C_PWM_GENERATOR_s* pg;
    
    // Capture Handle: set pointer to memory address of desired PWM instance
    pg = (volatile struct P33C_PWM_GENERATOR_s*) 
         ((volatile uint8_t*)&PG1CONL + ((pgInstance - 1) * P33C_PWMGEN_SFR_OFFSET));
    
    return(pg);
}

/*********************************************************************************
 * volatile uint16_t p33c_PwmGenerator_GetInstance(volatile struct P33C_PWM_GENERATOR_s* pg)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief Get the PWM generator index
 * @param  struct P33C_PWM_GENERATOR_s* pg: Pointer to PWM generator instance SFRs
 * @return 0 = failure, disabling PWM generator was not successful
 * @return 1 = success, disabling PWM generator was successful
 *  
 * @details
 *      This function gets the PWM generator index, the PWM generator group
 *      (1 = [PG1-PG4], 2 = [PG5-PG8]) and the address pointer (pgInstance) of
 *      the PWM generator Special Function Register set. pgInstance can be used
 *      to directly read from/write to PWM registers of the selected PWM 
 *      generator with zero API overhead.
 * 
 *********************************************************************************/
volatile uint16_t p33c_PwmGenerator_GetInstance(volatile struct P33C_PWM_GENERATOR_s* pg)
{
    volatile uint16_t retval=1;

    // Null-pointer protection
    if (pg == NULL)
        return(0);

    // Capture Instance: set pointer to memory address of desired PWM instance
    retval = (volatile uint16_t)
        (((volatile uint16_t)&pg->PGxCONL - (volatile uint16_t)&PG1CONL) / P33C_PWMGEN_SFR_OFFSET) + 1;
            
    if (retval > P33C_PG_COUNT)
        return(0); // PWM generator not member of a valid group 

    return(retval);
}

/*********************************************************************************
 * volatile uint16_t p33c_PwmGenerator_GetGroup(volatile struct P33C_PWM_GENERATOR_s* pg)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief Get the PWM generator group
 * @param  struct P33C_PWM_GENERATOR_s* pg: Pointer to PWM generator instance SFRs 
 * @return 0 = error, PWM generator group not found
 * @return 1 = PWM generator is in group #1
 * @return 2 = PWM generator is in group #2
 *  
 * @details
 *      This function identify the group toi which PWM generator belongs
 *      (1 = [PG1-PG4], 2 = [PG5-PG8]) and verify if the PWMgenerator group 
 *      is valid and available. If no group is found, the function returns '0'
 *********************************************************************************/
volatile uint16_t p33c_PwmGenerator_GetGroup(volatile struct P33C_PWM_GENERATOR_s* pg)
{
    volatile uint16_t retval=1;
    volatile uint16_t pgInstance;

    // Null-pointer protection
    if (pg == NULL)
        return(0);

    // Get group of PWM generator
    pgInstance = (volatile uint16_t)
        (((volatile uint16_t)&pg->PGxCONL - (volatile uint16_t)&PG1CONL) / P33C_PWMGEN_SFR_OFFSET + 1);
    
    // Verify PWM generator group is valid and available
    if (pgInstance > P33C_PG_COUNT)
        return(0); // PWM generator not member of a valid group 
    else if (pgInstance > 4)
        retval = 2; // PWM generator is member of group #2 [PG5-PG8]
    else
        retval = 1; // PWM generator is member of group #1 [PG1-PG4]

    return(retval);
}

/*********************************************************************************
 * @fn uint16_t p33c_PwmGenerator_SyncGenerators(volatile struct P33C_PWM_GENERATOR_s* pgHandleMother, volatile uint16_t pgMotherTriggerOutput, volatile struct P33C_PWM_GENERATOR_s* pgHandleChild, volatile bool ChildImmediateUpdate)
 * @ingroup lib-layer-pral-functions-public-pwm
 * @brief Sets the synchronization triggers of two PWM generators, of which the Mother PWM generator is the trigger provider and the Child PWM generator is the synchronization trigger receiver.
 * @param struct P33C_PWM_GENERATOR_s* pgHandleMother: PWM generator object of triggering PWM generator (sync trigger provider)
 * @param uint16_t pgMotherTriggerOutput: Trigger output selection of sync trigger provider PWM generator
 *          0 = EOC/SOC
 *          1 = PGxTRIGA
 *          2 = PGxTRIGB
 *          3 = PGxTRIGC
 * @param struct P33C_PWM_GENERATOR_s* pgHandleChild: PWM generator object of triggered PWM generator (sync trigger receiver)
 * @param bool ChildImmediateUpdate:
 *          true = synchronization trigger synchronizes Child PWM generator at trigger edge
 *          false = synchronization trigger synchronizes Child PWM generator at EOC/SOC
 * @return 0 = failure, PWM generator synchronization was not successful
 * @return 1 = success, PWM generator synchronization was successful
 * 
 * @details
 *      This function sets the synchronization triggers of two PWM generators, 
 *      of which the Mother PWM generator is the trigger provider and the Child
 *      PWM generator is the synchronization trigger receiver.
 * 
 *      The Mother PWM generator is configured to broadcast its UPDATE bit and
 *      provides one of four, selectable synchronization trigger outputs (EOC/SOC, 
 *      PGxTRIGA, PGxTRIGB or PGxTRIGC). The Mother PWM generator can be 
 *      independent or being triggered by another PWM generator.
 * 
 *      The Child PWM generator is configured to trigger on the event generated
 *      by the Mother PWM generator as configured above. The optional selection
 *      of immediate synchronization or synchronization of the SOC event is set 
 *      by parameter ChildImmediateUpdate.
 * 
 *********************************************************************************/

volatile uint16_t p33c_PwmGenerator_SyncGenerators(
                            volatile struct P33C_PWM_GENERATOR_s* pgHandleMother, 
                            volatile uint16_t pgMotherTriggerOutput,
                            volatile struct P33C_PWM_GENERATOR_s* pgHandleChild,
                            volatile bool ChildImmediateUpdate
    )
{
    volatile uint16_t retval=1;
    volatile uint16_t pgMotherInstance=0, pgChildInstance=0;
    volatile uint16_t pgMotherGroup=0, pgChildGroup=0;
    volatile uint16_t pgInstance;
    
